tutorials/combustion/reactingSolver/volvoTestCase/constant/combustionProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  PaSR;

active  true;

infinitelyFastChemistryCoeffs
{
    C       10.0;
}

PaSRCoeffs
{
    Cmix                10.0; 
    turbulentReaction   on; 
    useReactionRate     off;  
}


// ************************************************************************* //
