tutorials/combustion/reactingSolver/volvoTestCase/constant/thermophysicalProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

inertSpecie N2;

// Caelus format option

chemistryReader caelusChemistryReader;
caelusChemistryFile "$CAELUS_CASE/constant/reactions";
caelusChemistryThermoFile "$CAELUS_CASE/constant/thermo.compressibleGas";



// ************************************************************************* //
