tutorials/combustion/reactingSolver/volvoTestCase/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    rho
    {
        solver          PCG;
        preconditioner  SSGS;
        tolerance       0;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }

	
    p
	{
        solver          GAMG;
        tolerance       0;
        relTol          0.01;

        smoother        USGS;

        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    algebraicPair;
        mergeLevels     1;
        minIter         1;
    }

    pFinal
    {
        $p;
        tolerance       1e-09;
        relTol          0.01;
    }


    "(U|h|k)"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       0;
        relTol          0.1;
    }

    "(U|h|k)Final"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-09;
        relTol          0.1;
    }

    Yi
    {
        $hFinal;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2; // usually 2, no more than 4
    nNonOrthogonalCorrectors 0;
    rhoMin            rhoMin [ 1 -3 0 0 0 ] 0.0001;
    rhoMax            rhoMax [ 1 -3 0 0 0 ] 1000.0;
    transonic         yes;
}

// ************************************************************************* //
